marcin-filipiak/ardupic/boards.txt
# Board definitions for the ardupic platform (SDCC tools).
# PIC18F25K80 and PIC18F2X/4X50 share the PIC18 core API (pic16 arch),
# PIC16F877A runs the pic14 (baseline mid-range) target.

pic18f25k80.name=PIC18F25K80 (28-pin)

pic18f25k80.upload.maximum_size=32768
pic18f25k80.upload.maximum_data_size=2048
pic18f25k80.upload.tool=picprog-serial
pic18f25k80.upload.protocol=arduino

pic18f25k80.build.f_cpu=16000000L
pic18f25k80.build.mcu=PIC18F25K80
pic18f25k80.build.board=PIC18F25K80
pic18f25k80.build.core=pic18f25k80
pic18f25k80.build.variant=pic18f25k80

pic18f2550.name=PIC18F2550 (28-pin)

pic18f2550.upload.maximum_size=32768
pic18f2550.upload.maximum_data_size=2048
pic18f2550.upload.tool=picprog-serial
pic18f2550.upload.protocol=arduino

pic18f2550.build.f_cpu=48000000L
pic18f2550.build.mcu=PIC18F2550
pic18f2550.build.board=PIC18F2550
pic18f2550.build.core=pic18f2550
pic18f2550.build.variant=pic18f2550
pic18f2550.build.lkr=18f2550usb_g.lkr

pic18f4550.name=PIC18F4550 (40-pin)

pic18f4550.upload.maximum_size=32768
pic18f4550.upload.maximum_data_size=2048
pic18f4550.upload.tool=picprog-serial
pic18f4550.upload.protocol=arduino

pic18f4550.build.f_cpu=48000000L
pic18f4550.build.mcu=PIC18F4550
pic18f4550.build.board=PIC18F4550
pic18f4550.build.core=pic18f4550
pic18f4550.build.variant=pic18f4550
pic18f4550.build.lkr=18f4550usb_g.lkr

pic16f877a.name=PIC16F877A (40-pin)

pic16f877a.upload.maximum_size=8192
pic16f877a.upload.maximum_data_size=368
pic16f877a.upload.tool=picprog-serial
pic16f877a.upload.protocol=arduino

pic16f877a.build.f_cpu=4000000L
pic16f877a.build.mcu=PIC16F877A
pic16f877a.build.board=PIC16F877A
pic16f877a.build.core=pic16f877a
pic16f877a.build.variant=pic16f877a